spring2017/psyc5301/psyc5301-spring2017.org
#+TITLE: PSYC 5301: Research Methods
#+AUTHOR: 
#+DATE: Spring 2017
#+OPTIONS: toc:nil
#+OPTIONS: num:nil
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [10pt]
#+LATEX_HEADER: \usepackage[left=1in,right=1in,bottom=1in,top=1in]{geometry}

** Contact info
- Professor: Thomas J. Faulkenberry, Ph.D
- Office: Math 319
- Office hours: MTWRF 1-3 pm
- Email: faulkenberry@tarleton.edu
- Website: [[http://tomfaulkenberry.github.io]]
- Phone: 254-968-9816

** Course description

This course is designed to provide the student with a solid grounding in
the techniques of experimentation and subsequent statistical modeling that
form the empirical basis of modern psychological science.  We will 
accomplish this through lectures, textbook reading, and several hands-on
"laboratory" experiences, each designed to give the student a taste of the
research process, including data collection, analysis, and reporting.
All students enrolled in this course are required to have 
*previously taken* PSYC 5300 (Behavioral Statistics) or have equivalent
statistical background.  Note that we will meet face-to-face approximately 
once every two weeks (see schedule below). 

** Course materials

- /The Design and Conduct of Meaningful Experiments Involving Human Participants: 25 Scientific Principles/ by R. B. Bausell [[https://www.amazon.com/Conduct-Meaningful-Experiments-Involving-Participants/dp/0199385238][Amazon link]]
- /APA Publication Manual/ (6th ed.) [[http://www.amazon.com/Publication-Manual-American-Psychological-Association/dp/1433805618/][Amazon link]]
- JASP statistical software (free download from [[http://jasp-stats.org][jasp-stats.org]]).  Make sure your version is at least 0.8.

** Student learning outcomes

1. Understand the classical frameworks of hypothesis testing in psychological research
2. Develop research questions and translate those to testable hypotheses
3. Collect data using a variety of standard research paradigms
4. Analyze data using computer software
5. Communicate research results as a complete APA style manuscript
6. Develop a complete IRB protocol

** Requirements and grading
- Labs (150 points)
- Online discussions (100 points)
- IRB protocol (100 points)
- Class participation (50 points)
- /Total = 400 points/

Grades will be assigned based on the percentage of points you accumulate 
out of these 400 points.  I will use the standard grading scale of A=90%, 
B=80%, etc.

*** Labs (37.5% of grade)
There will be 3 lab assignments this semester.  The purpose of these 
assignments is to familiarize you with the complete research process, from
collecting data to analyzing the data and writing up the resulting manuscript.
The labs will involve the basic designs used in much of the psychological
literature, including independent groups designs, repeated measures designs,
and factorial designs.  Each lab is worth 50 points (10 points for the data you
collect and 40 points for the resulting manuscript). 

*** Online discussions (25% of grade)
Every online week (see schedule below), you will be given a reading from the textbook and/or other
external papers.  To ensure sufficient understanding of the readings, you will
participate in an online discussion.  These discussions will revolve around a 
small number of prompts, to which you will be required to (1) compose your 
response, and (2) respond to your classmates.  The grades will be assigned
largely on a /completion/ basis, but substantive responses are required.  You
/cannot/ simply respond "I agree" or "I disagree"...you must substantiate
your response(s) with data and/or a logical argument. 

