spring2017/psyc5301/psyc5301-spring2017.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>PSYC 5301: Research Methods</title>
<!-- 2017-01-10 Tue 11:52 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Thomas J. Faulkenberry, Ph.D." />
</head>
<body>
<div id="content">
<h1 class="title">PSYC 5301: Research Methods</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Contact info</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Professor: Thomas J. Faulkenberry, Ph.D
</li>
<li>Office: Math 319
</li>
<li>Office hours: MTWRF 1-3 pm
</li>
<li>Email: faulkenberry@tarleton.edu
</li>
<li>Website: <a href="http://tomfaulkenberry.github.io">http://tomfaulkenberry.github.io</a>
</li>
<li>Phone: 254-968-9816
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Course description</h2>
<div class="outline-text-2" id="text-2">
<p>
This course is designed to provide the student with a solid grounding in
the techniques of experimentation and subsequent statistical modeling that
form the empirical basis of modern psychological science.  We will 
accomplish this through lectures, textbook reading, and several hands-on
"laboratory" experiences, each designed to give the student a taste of the
research process, including data collection, analysis, and reporting.
All students enrolled in this course are required to have 
<b>previously taken</b> PSYC 5300 (Behavioral Statistics) or have equivalent
statistical background.  Note that we will meet face-to-face approximately 
once every two weeks (see schedule below). 
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Course materials</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><i>The Design and Conduct of Meaningful Experiments Involving Human Participants: 25 Scientific Principles</i> by R. B. Bausell <a href="https://www.amazon.com/Conduct-Meaningful-Experiments-Involving-Participants/dp/0199385238">Amazon link</a>
</li>
<li><i>APA Publication Manual</i> (6th ed.) <a href="http://www.amazon.com/Publication-Manual-American-Psychological-Association/dp/1433805618/">Amazon link</a>
</li>
<li>JASP statistical software (free download from <a href="http://jasp-stats.org">jasp-stats.org</a>).  Make sure your version is at least 0.8.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Student learning outcomes</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Understand the classical frameworks of hypothesis testing in psychological research
</li>
<li>Develop research questions and translate those to testable hypotheses
</li>
<li>Collect data using a variety of standard research paradigms
</li>
<li>Analyze data using computer software
</li>
<li>Communicate research results as a complete APA style manuscript
</li>
<li>Develop a complete IRB protocol
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Requirements and grading</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Labs (150 points)
</li>
<li>Online discussions (100 points)
</li>
<li>IRB protocol (100 points)
</li>
<li>Class participation (50 points)
</li>
<li><i>Total = 400 points</i>
</li>
</ul>

<p>
Grades will be assigned based on the percentage of points you accumulate 
out of these 400 points.  I will use the standard grading scale of A=90%, 
B=80%, etc.
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">Labs (37.5% of grade)</h3>
<div class="outline-text-3" id="text-5-1">
<p>
There will be 3 lab assignments this semester.  The purpose of these 
assignments is to familiarize you with the complete research process, from
collecting data to analyzing the data and writing up the resulting manuscript.
The labs will involve the basic designs used in much of the psychological
literature, including independent groups designs, repeated measures designs,
and factorial designs.  Each lab is worth 50 points (10 points for the data you
collect and 40 points for the resulting manuscript). 
</p>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">Online discussions (25% of grade)</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Every online week (see schedule below), you will be given a reading from the textbook and/or other
external papers.  To ensure sufficient understanding of the readings, you will
participate in an online discussion.  These discussions will revolve around a 
small number of prompts, to which you will be required to (1) compose your 
response, and (2) respond to your classmates.  The grades will be assigned
largely on a <i>completion</i> basis, but substantive responses are required.  You
<i>cannot</i> simply respond "I agree" or "I disagree"&#x2026;you must substantiate
your response(s) with data and/or a logical argument. 
</p>
</div>
</div>
