spring2017/psyc5301/psyc5301-spring2017.tex
% Created 2017-01-13 Fri 13:05
\documentclass[10pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[left=1in,right=1in,bottom=1in,top=1in]{geometry}
\date{Spring 2017}
\title{PSYC 5301: Research Methods}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.1.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle

\section*{Contact info}
\label{sec-1}
\begin{itemize}
\item Professor: Thomas J. Faulkenberry, Ph.D
\item Office: Math 319
\item Office hours: MTWRF 1-3 pm
\item Email: faulkenberry@tarleton.edu
\item Website: \url{http://tomfaulkenberry.github.io}
\item Phone: 254-968-9816
\end{itemize}

\section*{Course description}
\label{sec-2}

This course is designed to provide the student with a solid grounding in
the techniques of experimentation and subsequent statistical modeling that
form the empirical basis of modern psychological science.  We will 
accomplish this through lectures, textbook reading, and several hands-on
"laboratory" experiences, each designed to give the student a taste of the
research process, including data collection, analysis, and reporting.
All students enrolled in this course are required to have 
\textbf{previously taken} PSYC 5300 (Behavioral Statistics) or have equivalent
statistical background.  Note that we will meet face-to-face approximately 
once every two weeks (see schedule below). 

\section*{Course materials}
\label{sec-3}

\begin{itemize}
\item \emph{The Design and Conduct of Meaningful Experiments Involving Human Participants: 25 Scientific Principles} by R. B. Bausell \href{https://www.amazon.com/Conduct-Meaningful-Experiments-Involving-Participants/dp/0199385238}{Amazon link}
\item \emph{APA Publication Manual} (6th ed.) \href{http://www.amazon.com/Publication-Manual-American-Psychological-Association/dp/1433805618/}{Amazon link}
\item JASP statistical software (free download from \href{http://jasp-stats.org}{jasp-stats.org}).  Make sure your version is at least 0.8.
\end{itemize}

\section*{Student learning outcomes}
\label{sec-4}

\begin{enumerate}
\item Understand the classical frameworks of hypothesis testing in psychological research
\item Develop research questions and translate those to testable hypotheses
\item Collect data using a variety of standard research paradigms
\item Analyze data using computer software
\item Communicate research results as a complete APA style manuscript
\item Develop a complete IRB protocol
\end{enumerate}

\section*{Requirements and grading}
\label{sec-5}
\begin{itemize}
\item Labs (150 points)
\item Online discussions (100 points)
\item IRB protocol (100 points)
\item Class participation (50 points)
\item \emph{Total = 400 points}
\end{itemize}

Grades will be assigned based on the percentage of points you accumulate 
out of these 400 points.  I will use the standard grading scale of A=90\%, 
B=80\%, etc.

\subsection*{Labs (37.5\% of grade)}
\label{sec-5-1}
There will be 3 lab assignments this semester.  The purpose of these 
assignments is to familiarize you with the complete research process, from
collecting data to analyzing the data and writing up the resulting manuscript.
The labs will involve the basic designs used in much of the psychological
literature, including independent groups designs, repeated measures designs,
and factorial designs.  Each lab is worth 50 points (10 points for the data you
collect and 40 points for the resulting manuscript). 

\subsection*{Online discussions (25\% of grade)}
\label{sec-5-2}
Every online week (see schedule below), you will be given a reading from the textbook and/or other
external papers.  To ensure sufficient understanding of the readings, you will
participate in an online discussion.  These discussions will revolve around a 
small number of prompts, to which you will be required to (1) compose your 
response, and (2) respond to your classmates.  The grades will be assigned
largely on a \emph{completion} basis, but substantive responses are required.  You
\emph{cannot} simply respond "I agree" or "I disagree"\ldots{}you must substantiate
your response(s) with data and/or a logical argument. 
