spring2017/psyc5301/psyc5301-spring2017.tex

\subsection*{IRB protocol (25\% of grade)}
\label{sec-5-3}
In order to complete the research component of your MS degree, you will have
to complete an IRB protocol that documents your procedures to ensure that your
research will be conducted in a manner that is considered ethical.  To help with
this process, you will be asked to complete an IRB protocol in this course
using the submission form developed by the IRB at our university. 
The topic that you propose to study and the research questions you ask are up 
to you; the important part is that your study is (1) well-designed, and (2) 
all ethical protocols are prepared and in place.

The assignment for your protocol will be divided into two major portions.  First,
you will complete a protocol and submit it to me (around Week 14).  I will then
assign each protocol to two class members for peer review.  The purpose of this
peer review is to model the process that happens at our university (each protocol
is assigned to two peer reviewers) as well as to give you two sets of feedback
on your protocol that should help with your actual protocols that you submit
to conduct your MS research.

\subsection*{Class participation (12.5\% of grade)}
\label{sec-5-4}
This is a very active course.  It is essential that you participate in \emph{all}
activities, both online and in our face-to-face sessions.  Your class participation
grade will be reflective of the effort that I've seen you put into the course.
Most people will earn all 50 possible points, but I reserve the right to lower
this grade if you miss excessive class meetings.

\section*{Course Communication}
\label{sec-6}

I am your primary resource for this course. I AM an experimental psychologist, so I do the stuff I teach about daily. Hence, my primary interest is for you to learn this material and do well in the course. If you have a question, always feel free to stop by my office and visit.  If you require electronic communication, email is best, but you may also send me a Blackboard message.  Just keep in mind that I don't get any notifications of Blackboard messages, so I may not see your message until I next log into the course.

\section*{University Policy on "F" Grades}
\label{sec-7}

Beginning in Fall 2015, Tarleton will begin differentiating between a failed grade in a class because a student never attended (F0 grade), stopped attending at some point in the semester (FX grade), or because the student did not pass the course (F) but attended the entire semester. These grades will be noted on the official transcript. Stopping or never attending class can result in the student having to return aid monies received.  For more information see the Tarleton Financial Aid website.

\section*{Academic Honesty}
\label{sec-8}

Cheating, plagiarism (submitting another person’s materials or ideas as one’s own), or doing work for another person who will receive academic credit are all disallowed. This includes the use of unauthorized books, notebooks, or other sources in order to secure of give help during an examination, the unauthorized copying of examinations, assignments, reports, or term papers, or the presentation of unacknowledged material as if it were the student’s own work. Disciplinary action may be taken beyond the academic discipline administered by the faculty member who teaches the course in which the cheating took place.

In particular, any exam taken online must be completed without the aid of any unauthorized resource (including using any search engine, Google, etc.).  Authorized resources are limited only to the official textbook and any lecture notes from the course.  Any other authorized resources will be provided to you before the exam.  The minimum sanction for violation of this policy is a grade of 0 on the affected exam.

\section*{Academic Affairs Core Value Statements}
\label{sec-9}

\subsection*{Academic Integrity Statement}
\label{sec-9-1}
Tarleton State University's core values are integrity, leadership, tradition, civility, excellence, and service.  Central to these values is integrity, which is maintaining a high standard of personal and scholarly conduct.  Academic integrity represents the choice to uphold ethical responsibility for one’s learning within the academic community, regardless of audience or situation.

\subsection*{Academic Civility Statement}
\label{sec-9-2}
Students are expected to interact with professors and peers in a respectful manner that enhances the learning environment. Professors may require a student who deviates from this expectation to leave the face-to-face (or virtual) classroom learning environment for that particular class session (and potentially subsequent class sessions) for a specific amount of time. In addition, the professor might consider the university disciplinary process (for Academic Affairs/Student Life) for egregious or continued disruptive behavior.
