spring2017/psyc5301/psyc5301-spring2017.org
*** Academic Excellence Statement
Tarleton holds high expectations for students to assume responsibility for their own individual learning. Students are also expected to achieve academic excellence by:
- honoring Tarleton’s core values, upholding high standards of habit and behavior.
- maintaining excellence through class attendance and punctuality, preparing for active participation in all learning experiences. 
- putting forth their best individual effort.
- continually improving as independent learners.
- engaging in extracurricular opportunities that encourage personal and academic growth.
- reflecting critically upon feedback and applying these lessons to meet future challenges.

** Students with Disabilities Policy

It is the policy of Tarleton State University to comply with the Americans with Disabilities Act and other applicable laws. If you are a student with a disability seeking accommodations for this course, please contact the Center for Access and Academic Testing, at 254.968.9400 or caat@tarleton.edu. The office is located in Math 201. More information can be found at www.tarleton.edu/caat or in the University Catalog.



**Note:  any changes to this syllabus will be communicated to you by the instructor!**
 
** Tentative weekly schedule
/Note: this schedule will be updated as the semester goes!/
- Week 1: Jan 17 (face-to-face)
  - intro to course
  - review of statistics
  - intro to JASP
- Week 2: Jan 24 (online)
  - read ???
  - online discussion board 
- Week 3: Jan 31 (face-to-face)
  - introduce Lab 1 assignment
  - writing effective intro and method sections 
- Week 4: Feb 7 (online)
  - collect Lab 1 data
  - read ???
  - online discussion board
- Week 5: Feb 14 (face-to-face)
  - Turn in Lab 1 data
  - data analysis techniques
  - writing effective results and discussion sections
- Week 6: Feb 21 (online)
  - work on Lab 1 manuscript
  - read ???
  - online discussion board
- Week 7: Feb 28 (face-to-face)
  - turn in Lab 1 manuscript
  - introduce Lab 2 assignment
- Week 8: Mar 7 (online)
  - collect Lab 2 data
  - read ???
  - online discussion board
- Week 9: Mar 21 (online)
  - continue collecting Lab 2 data
  - read ???
  - online discussion board
- Week 10: Mar 28 (face-to-face)
  - turn in Lab 2 data
  - data analysis techniques
- Week 11: Apr 4 (online)
  - work on Lab 2 manuscrip
  - read ???
  - online discussion board
- Week 12: Apr 11 (face-to-face)
  - Turn in Lab 2 manuscript
  - how to complete IRB protocols
- Week 13: Apr 18 (online)
  - work on IRB protocol
- Week 14: Apr 25 (face-to-face)
  - turn in IRB protocol
  - introduce Lab 3 assignment
- Week 15: May 2 (online)
  - work on IRB reviews
  - work on Lab 3 manuscript
- Week 16: May 9 (face-to-face)
  - turn in IRB reviews
  - turn in Lab 3 manuscript
