spring2017/psyc5301/psyc5301-spring2017.html

<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3">Academic Excellence Statement</h3>
<div class="outline-text-3" id="text-9-3">
<p>
Tarleton holds high expectations for students to assume responsibility for their own individual learning. Students are also expected to achieve academic excellence by:
</p>
<ul class="org-ul">
<li>honoring Tarleton’s core values, upholding high standards of habit and behavior.
</li>
<li>maintaining excellence through class attendance and punctuality, preparing for active participation in all learning experiences. 
</li>
<li>putting forth their best individual effort.
</li>
<li>continually improving as independent learners.
</li>
<li>engaging in extracurricular opportunities that encourage personal and academic growth.
</li>
<li>reflecting critically upon feedback and applying these lessons to meet future challenges.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">Students with Disabilities Policy</h2>
<div class="outline-text-2" id="text-10">
<p>
It is the policy of Tarleton State University to comply with the Americans with Disabilities Act and other applicable laws. If you are a student with a disability seeking accommodations for this course, please contact the Center for Access and Academic Testing, at 254.968.9400 or caat@tarleton.edu. The office is located in Math 201. More information can be found at www.tarleton.edu/caat or in the University Catalog.
</p>



<p>
<b><b>Note:  any changes to this syllabus will be communicated to you by the instructor!</b></b>
</p>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">Tentative weekly schedule</h2>
<div class="outline-text-2" id="text-11">
<p>
<i>Note: this schedule will be updated as the semester goes!</i>
</p>
<ul class="org-ul">
<li>Week 1: Jan 17 (face-to-face)
<ul class="org-ul">
<li>intro to course
</li>
<li>review of statistics
</li>
<li>intro to JASP
</li>
</ul>
</li>
<li>Week 2: Jan 24 (online)
<ul class="org-ul">
<li>read ???
</li>
<li>online discussion board 
</li>
</ul>
</li>
<li>Week 3: Jan 31 (face-to-face)
<ul class="org-ul">
<li>introduce Lab 1 assignment
</li>
<li>writing effective intro and method sections 
</li>
</ul>
</li>
<li>Week 4: Feb 7 (online)
<ul class="org-ul">
<li>collect Lab 1 data
</li>
<li>read ???
</li>
<li>online discussion board
</li>
</ul>
</li>
<li>Week 5: Feb 14 (face-to-face)
<ul class="org-ul">
<li>Turn in Lab 1 data
</li>
<li>data analysis techniques
</li>
<li>writing effective results and discussion sections
</li>
</ul>
</li>
<li>Week 6: Feb 21 (online)
<ul class="org-ul">
<li>work on Lab 1 manuscript
</li>
<li>read ???
</li>
<li>online discussion board
</li>
</ul>
</li>
<li>Week 7: Feb 28 (face-to-face)
<ul class="org-ul">
<li>turn in Lab 1 manuscript
</li>
<li>introduce Lab 2 assignment
</li>
</ul>
</li>
<li>Week 8: Mar 7 (online)
<ul class="org-ul">
<li>collect Lab 2 data
</li>
<li>read ???
</li>
<li>online discussion board
</li>
</ul>
</li>
<li>Week 9: Mar 21 (online)
<ul class="org-ul">
<li>continue collecting Lab 2 data
</li>
<li>read ???
</li>
<li>online discussion board
</li>
</ul>
</li>
<li>Week 10: Mar 28 (face-to-face)
<ul class="org-ul">
<li>turn in Lab 2 data
</li>
<li>data analysis techniques
</li>
</ul>
</li>
<li>Week 11: Apr 4 (online)
<ul class="org-ul">
<li>work on Lab 2 manuscrip
</li>
<li>read ???
</li>
<li>online discussion board
</li>
</ul>
</li>
<li>Week 12: Apr 11 (face-to-face)
<ul class="org-ul">
<li>Turn in Lab 2 manuscript
</li>
<li>how to complete IRB protocols
</li>
</ul>
</li>
<li>Week 13: Apr 18 (online)
<ul class="org-ul">
<li>work on IRB protocol
</li>
</ul>
</li>
<li>Week 14: Apr 25 (face-to-face)
<ul class="org-ul">
<li>turn in IRB protocol
</li>
<li>introduce Lab 3 assignment
</li>
</ul>
</li>
<li>Week 15: May 2 (online)
<ul class="org-ul">
<li>work on IRB reviews
</li>
<li>work on Lab 3 manuscript
</li>
</ul>
</li>
<li>Week 16: May 9 (face-to-face)
<ul class="org-ul">
<li>turn in IRB reviews
</li>
<li>turn in Lab 3 manuscript
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Spring 2017</p>
<p class="author">Author: Thomas J. Faulkenberry, Ph.D.</p>
<p class="date">Created: 2017-01-10 Tue 11:52</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
