spring2017/psyc5301/psyc5301-spring2017.tex

\subsection*{Academic Excellence Statement}
\label{sec-9-3}
Tarleton holds high expectations for students to assume responsibility for their own individual learning. Students are also expected to achieve academic excellence by:
\begin{itemize}
\item honoring Tarleton’s core values, upholding high standards of habit and behavior.
\item maintaining excellence through class attendance and punctuality, preparing for active participation in all learning experiences.
\item putting forth their best individual effort.
\item continually improving as independent learners.
\item engaging in extracurricular opportunities that encourage personal and academic growth.
\item reflecting critically upon feedback and applying these lessons to meet future challenges.
\end{itemize}

\section*{Students with Disabilities Policy}
\label{sec-10}

It is the policy of Tarleton State University to comply with the Americans with Disabilities Act and other applicable laws. If you are a student with a disability seeking accommodations for this course, please contact the Center for Access and Academic Testing, at 254.968.9400 or caat@tarleton.edu. The office is located in Math 201. More information can be found at www.tarleton.edu/caat or in the University Catalog.



\textbf{\textbf{Note:  any changes to this syllabus will be communicated to you by the instructor!}}

\section*{Tentative weekly schedule}
\label{sec-11}
\emph{Note: this schedule will be updated as the semester goes!}
\begin{itemize}
\item Week 1: Jan 17 (face-to-face)
\begin{itemize}
\item intro to course
\item review of statistical foundations
\item intro to JASP
\end{itemize}
\item Week 2: Jan 24 (online)
\begin{itemize}
\item read Chapters 1 and 2
\item online discussion board
\end{itemize}
\item Week 3: Jan 31 (face-to-face)
\begin{itemize}
\item introduce Lab 1 assignment
\item writing effective intro and method sections
\end{itemize}
\item Week 4: Feb 7 (online)
\begin{itemize}
\item collect Lab 1 data
\item read Chapters 3 and 4
\item online discussion board
\end{itemize}
\item Week 5: Feb 14 (face-to-face)
\begin{itemize}
\item Turn in Lab 1 data
\item data analysis techniques
\item writing effective results and discussion sections
\end{itemize}
\item Week 6: Feb 21 (online)
\begin{itemize}
\item work on Lab 1 manuscript
\item read Chapter 5
\item online discussion board
\end{itemize}
\item Week 7: Feb 28 (face-to-face)
\begin{itemize}
\item turn in Lab 1 manuscript
\item introduce Lab 2 assignment
\end{itemize}
\item Week 8: Mar 7 (online)
\begin{itemize}
\item collect Lab 2 data
\item read Chapter 6
\item online discussion board
\end{itemize}
\item Week 9: Mar 21 (online)
\begin{itemize}
\item continue collecting Lab 2 data
\item read Chapter 7
\item online discussion board
\end{itemize}
\item Week 10: Mar 28 (face-to-face)
\begin{itemize}
\item turn in Lab 2 data
\item data analysis techniques
\end{itemize}
\item Week 11: Apr 4 (online)
\begin{itemize}
\item work on Lab 2 manuscrip
\item read Chapter 8
\item online discussion board
\end{itemize}
\item Week 12: Apr 11 (face-to-face)
\begin{itemize}
\item Turn in Lab 2 manuscript
\item how to complete IRB protocols
\end{itemize}
\item Week 13: Apr 18 (online)
\begin{itemize}
\item read Chapters 9 and 10
\item online discussion board
\item work on IRB protocol
\end{itemize}
\item Week 14: Apr 25 (face-to-face)
\begin{itemize}
\item turn in IRB protocol
\item introduce Lab 3 assignment
\end{itemize}
\item Week 15: May 2 (online)
\begin{itemize}
\item work on IRB reviews
\item work on Lab 3 manuscript
\end{itemize}
\item Week 16: May 9 (face-to-face)
\begin{itemize}
\item turn in IRB reviews
\item turn in Lab 3 manuscript
\end{itemize}
\end{itemize}
% Emacs 25.1.1 (Org mode 8.2.10)
\end{document}